Revit 2027 API
FailureMessageAccessor.GetNumberOfResolutions Method
 Retrieves number of resolutions that can be used to resolve failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfResolutions()
Public Function GetNumberOfResolutions As Integer
public:
int GetNumberOfResolutions()
member GetNumberOfResolutions : unit -> int
Return Value
Int32
 Number of resolutions that can be used to resolve failure
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
Remarks
 If number of resolutions is zero, the failure cannot be resolved. If severity of the failure is Warning, it can be deleted. Otherwise, the only option is to cancel current operation and roll back the transaction
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace